<?php
namespace okaCTO;

class main
{
	public $arr_kkm_sno = [
		'0' => ['- Можно выбрать несколько -', ''],
		'1' => ['ОСН', ''],
		'2' => ['ОСН+УСН (доход)', ''],
		'3' => ['ОСН+УСН (расход)', ''],
		'4' => ['ОСН+ЕСХН', ''],
		'5' => ['ОСН+ЕНВД', ''],
		'6' => ['ОСН+ПСН', ''],
		'7' => ['УСН (доход)', ''],
		'8' => ['УСН (доход) - (расход)', ''],
		'9' => ['УСН (доход) + ЕСХН', ''],
		'10' => ['УСН (доход) + ЕНВД', ''],
		'11' => ['УСН (доход) + ПСН', ''],
		'12' => ['УСН (расход)', ''],
		'13' => ['УСН (расход) + ЕСХН', ''],
		'14' => ['УСН (расход) + ЕНВД', ''],
		'15' => ['УСН (расход) + ПСН', ''],
		'16' => ['ЕСХН', ''],
		'17' => ['ЕСХН + ЕНВД', ''],
		'18' => ['ЕСХН + ПСН', ''],
		'19' => ['ЕНВД', ''],
		'20' => ['ЕНВД + ПСН', ''],
		'21' => ['ПСН', ''],
		'22' => ['УСН (доход) - (расход) + ЕНВД', ''],
	];
	
	public $arr_groups_product = [
		'0' => ['- Можно выбрать несколько -', ''],
		'1' => ['Кондитерские изделия', ''],
		'2' => ['Лекарства', ''],
		'3' => ['Продукты', ''],
		'4' => ['Сигареты', ''],
		'5' => ['Пиво', ''],
		'6' => ['Водка', ''],
		'7' => ['Канцелярские товары', ''],
		'8' => ['Одежда', ''],
		'9' => ['Косметика, Парфюм', ''],
		'10' => ['Мебель', ''],
		'11' => ['Автозапчасти', ''],
		'12' => ['Автомасла', ''],
		'13' => ['Спорт товары', ''],
		'14' => ['Стройматериалы', ''],
		'15' => ['Ткани', ''],
		'16' => ['Шторы', ''],
		'17' => ['Автомобили', ''],
		'18' => ['Обувь', ''],
		'19' => ['Ювелирные изделия', ''],
		'20' => ['Оптика', ''],
		'21' => ['Промышленные товары', ''],
		'22' => ['Общепит', ''],
		'23' => ['Цветы', ''],
		'24' => ['Зоотовары', ''],
		'25' => ['Швейная фурнитура', ''],
		'26' => ['Мед. Товары', ''],
		'27' => ['Текстиль', ''],
		'28' => ['Приборы учета', ''],
		'29' => ['Газеты, журналы', ''],
		'30' => ['Мед. Услуги', ''],
		'31' => ['Ремонт автомобилей', ''],
		'32' => ['Ритуальные услуги', ''],
		'33' => ['Парикмахерские услуги', ''],
		'34' => ['Ремонт копьютеров и орг. Техники', ''],
		'35' => ['Услуги Эвакуатора', ''],
		'36' => ['Туристические услуги', ''],
		'37' => ['Образовательные услуги', ''],
		'38' => ['Аренда помещений', ''],
		'39' => ['Фитнес услуги', ''],
		'40' => ['Услуги рекламы', ''],
		'41' => ['Автосервис', ''],
		'42' => ['Ветеринарные услуги', ''],
		'43' => ['Услуги по обучению', ''],
		'44' => ['Фото услуги', ''],
		'45' => ['Транспортные услуги', ''],
		'46' => ['Услуги недвижимости', ''],
		'47' => ['Товары для дома,услуги', ''],
		'48' => ['Хоз. Товары', ''],
		'49' => ['Крупы, мука', ''],
		'50' => ['Видеонаблюдение', ''],
		'51' => ['Охрана', ''],
		'52' => ['', ''],
		'53' => ['Прием металла', ''],
		'54' => ['Стояна/парковка', ''],
		'55' => ['Мясная продукция', ''],
		'56' => ['Бытовая техника', ''],
		'57' => ['Производство протезов', ''],
		'58' => ['Доп. Оборудование к сельхоз технике', ''],
		'59' => ['Молочная продукция', ''],
		'60' => ['Сдача отчетностей, деклараций', ''],
		'61' => ['Меха', ''],
		'62' => ['Кожгалантерея', ''],
		'63' => ['Сувениры, подарки, аксессуары к телефону', ''],
		'64' => ['Семена, садовый инвентарь, декор', ''],
		'65' => ['Замочно-скобяные изделия', ''],
		'66' => ['изготовление патронов', ''],
		'67' => ['Пиломатериалы, лес', ''],
		'68' => ['Асбестотехнические изделия', ''],
		'69' => ['Услуги тех. Обслуживания, установки оборудования', ''],
		'70' => ['Препараты от грызунов, насекомых', ''],
		'71' => ['Головные уборы', ''],
		'72' => ['Услуги грузчиков', ''],
		'73' => ['Часы', ''],
		'74' => ['Игрушки', ''],
		'75' => ['Аудит', ''],
		'76' => ['Услуги населению', ''],
		'77' => ['Букмекерская деятельность, прием ставок', ''],
		'78' => ['Антиквариат', ''],
		'79' => ['Услуги трудоустройства', ''],
		'80' => ['Сантехника', ''],
		'81' => ['Оптовая продажа рыбы', ''],
		'82' => ['Электрика, светотехника и т.д.', ''],
		'83' => ['Музыкальные инструменты', ''],
		'84' => ['Бассейны', ''],
		'85' => ['Пекарня', ''],
		'86' => ['Зоопарк', ''],
		'87' => ['Свадебный салон', ''],
		'88' => ['Займы денег', ''],
		'89' => ['Металлоконструкции', ''],
		'90' => ['Резинотехнические изделия', ''],
		'91' => ['Автомойка', ''],
		'92' => ['Мототехника', ''],
		'93' => ['Производство', ''],
		'94' => ['Гостиница', ''],
		'95' => ['Мультикасса', ''],
		'96' => ['Сотовые', ''],
		'97' => ['Аксессуары и орг. Техника', ''],
		'98' => ['Тех. Газ', ''],
		'99' => ['Услуги консультации', ''],
		'100' => ['Услуги в сфере IT', ''],
		'101' => ['Типография', ''],
		'102' => ['Клининговые услуги', ''],
		'103' => ['Услуги страхованя', ''],
		'104' => ['Изготовление стекол на кухню', ''],
		'105' => ['Охота, туризм, рыбалка', ''],
		'106' => ['Курьерские услуги, доставка', ''],
		'107' => ['Агентские услуги', ''],
		'108' => ['Строительные работы', ''],
		'109' => ['Билеты(театр, кино)', ''],
		'110' => ['Интернет кафе', ''],
		'111' => ['Алмазное бурение', ''],
		'112' => ['Производство кирпича', ''],
		'113' => ['Навигация', ''],
	];
	

	/*
	 * $strDate - строка с датой в формате YYYY-MM-DD
	 */
    public function getData($strDate)
    {
    //    $access_date = '2000-05-27';

    // функция  explode() разбивает  строку другой строкой. В данном случае
    // $access_date разбит на символе "-"

        $date_elements = explode("-", $strDate);

        return mktime(0,0,0, $date_elements[1], $date_elements[2], $date_elements[0]);
    }

	private function showHead()
	{
		require 'views/head.php';
	}
	
	public function show404()
	{
		$this->showHead();
		require 'views/404.php';
		$this->showFooter();
	}
	
	private function showFooter()
	{
		require 'views/footer.php';
	}
	
	public function showHome()
	{
		$this->showHead();
		require 'views/home.php';
		$this->showFooter();
	}

	/*
	 * Активные тикеты мастера
	 * $tickets - На входе массив с выбранными тикетами
	 */
	public function showTickets($tickets)
	{
		$this->showHead();
		require 'views/tickets.php';
		$this->showFooter();
	}

	/*
	 * $ticket - На входе массив с выбранными тикетами
	 * $closeTicket : 0 - не закрывать тикет
	 *                1 - закрыть тикет
	 */
	public function showChangeTicket($ticket, $closeTicket)
	{
		$this->showHead();
		require 'views/changeTicket.php';
		$this->showFooter();
	}

    /*
     * История закрытых тикетов
     * $tickets - На входе массив с выбранными тикетами
     */
    public function showHistory($tickets)
    {
        $this->showHead();
        require 'views/history.php';
        $this->showFooter();
    }

    public function showInfoKKM($getArr)
    {
	    $arr_kkm_sno = $this->arr_kkm_sno;
	    $arr_groups_product = $this->arr_groups_product;
	    
	    $this->showHead();
    	require 'views/infoKKM.php';
    	$this->showFooter();
    }
    
	public function showApi($text)
	{
		//require 'src/api.php';
	}
		
	
	
}